app/controllers/admin/categories_controller.rb

SELECT * FROM `categories`
---
  def index
    @categories = Category.all

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
---
  def show
    @category = Category.find(params[:id])

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES('Pouf', '2009-12-14 11:28:12', '2009-12-14 11:28:12')
---
  def create
    @category = Category.new(params[:category])
    if @category.save

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
---
  def edit
    @category = Category.find(params[:id])

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
UPDATE `categories` SET `updated_at` = '2009-12-14 11:37:28', `name` = 'Chats' WHERE `id` = 1
---
  def update
    @category = Category.find(params[:id])
    if @category.update_attributes(params[:category])