app/controllers/admin/products_controller.rb

  def index
    @products = Product.all
---
SELECT * FROM `products`

  def show
    @product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)

  def create
    @product = Product.new(params[:product])
    if @product.save
---
INSERT INTO `products` (`name`, `price`, `created_at`, `updated_at`, `category_id`) VALUES('zed', 10.2, '2009-12-14 12:17:53', '2009-12-14 12:17:53', 1)